Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: རྒྱལ་བའི་དམ་ཆོས་ལོ་གྲངས་སྟོང་ཕྲག་ནི། །བརྒྱ་སྙེད་ཚང་བའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma of this victor Will remain for one hundred thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །ཞིང་རྣམས་ཀུན་ཏུ་གསེར་གྱིས་རྣམ་པར་བརྒྱན། །
en: The relics of this victor will be abundant Throughout the realms and adorned with gold.

source: དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་སྣ་ཚོགས་ཀྱི། །སྐྱེ་བའི་ཡུལ་ནི་འོད་ཟེར་མཆོག་ཅེས་བྱ། །
en: “The thus-gone Citraraśmi Will be born in a place called Supreme Radiance.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་ལྔ་ཡོད་ཡབ་ནི་ཟླ་བཟང་ཡིན། །འོད་ཟེར་མཆོག་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend five leagues. “Excellent Moon will be his father, and Supreme Radiance will be this victor’s mother.

source: སྲས་པོ་བཟང་ལྡན་ཟླ་བ་རིམ་གྲོ་པ། །
en: Endowed with Excellence will be his son and Moon his attendant.

source: ཟླ་ཉིའི་འོད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Light of the Moon and Sun will be the scholar

source: སྐར་མཁན་རྒྱལ་པོ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And King of Astrologers the one of miracles.

source: འདུས་པ་དག་ནི་ལན་གྲངས་བདུན་ཅུ་ལ། །དབང་པོ་ཐོབ་པའི་ཚོགས་དག་འདུས་འགྱུར་ཏེ། །འབུམ་ཕྲག་བརྒྱད་ཅུ་རྩ་གསུམ་སྙེད་གཅིག་འབྱུང་། །
en: “There will be seventy consecutive congregations, Each of them gathering eight million three hundred thousand Who have attained the faculties.

source: སྟོན་པ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་དགུ་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And when this teacher has attained nirvāṇa His sacred Dharma will remain for ninety thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །རིན་ཆེན་ལྷ་ཡི་གཞལ་མེད་ཁང་པར་ལྡན། །
en: The relics of this victor will be contained in a stūpa That is adorned with precious, heavenly palaces.

source: དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་དཔའ་བོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ས་ཡི་མཆོད་རྟེན་ཡིན། །
en: “The thus-gone Jñānaśūra Will be born in a place called Stūpa of the Ground.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གཅིག་ཡབ་ནི་དོན་བྱས་ཡིན། །མཐུ་རྩལ་བློ་གྲོས་མ་ནི་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend twenty-one leagues. “Benefit Accomplished will be his father, and Powerful Intelligence will be this victor’s mother.

source: སྲས་པོ་ཆོས་ཅན་ཆོས་བཟངས་རིམ་གྲོ་པ། །
en: Endowed with Dharma will be his son and Excellent Dharma his attendant.

source: མི་དབང་བློ་གྲོས་ཞེས་བྱ་བློ་ཅན་ཏེ། །
en: Royal Intelligence will be the scholar

source: འཁྲུགས་པ་མེད་པར་གནས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Remaining Unperturbed the one of miracles.

source: འདུས་པ་ལན་གྲངས་ཉི་ཤུ་ཀུན་ལ་ཡང་། །ཐར་པར་གཞོལ་བ་ཞི་བ་ཐོབ་པ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be twenty consecutive congregations, Each of them gathering nine hundred twenty million Who have merged with liberation and attained serenity.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་ལྔ་པ་བཀོད་པས་རྣམ་པར་སྤྲས། །
en: There will be a single stūpa with the relics of this victor, Five leagues large and beautifully decorated.

source: དེ་བཞིན་གཤེགས་པ་པད་མའི་ཕུང་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་སྣང་ཞེས་བྱ། །
en: “The thus-gone Padmagarbha Will be born in a place called Light of Merit.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་པད་མ་ཡིན། །རིན་ཆེན་མེ་ཏོག་ཅེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend one hundred leagues. “Lotus will be his father, and Jewel Flower will be this victor’s mother.

source: སྲས་པོ་པད་ལྡན་པད་དཀར་རིམ་གྲོ་པ། །
en: Lotus Possessor will be his son and White Lotus his attendant.

source: ངེས་པར་བྱས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Ascertained will be the scholar

source: འདུས་པ་ལན་གྲངས་བཅུ་གཅིག་ཀུན་ལ་ཡང་། །བདུད་ཀྱི་ཕྱོགས་རྣམས་རབ་ཏུ་བཅོམ་པ་པོ། །བྱེ་བ་ཕྲག་ནི་ཁྲི་ཕྲག་གསུམ་གསུམ་ཡོད། །
en: “There will be eleven consecutive congregations, Each of them gathering three hundred billion Vanquishers of the forces of the māras.

source: མི་ཚེ་ལོ་གྲངས་སུམ་ཁྲི་བཞི་སྟོང་ཡིན། །
en: The lifespan of humans will be thirty-four thousand years,

source: གྲགས་པ་མཐའ་ཡས་པ་ཡི་དམ་ཆོས་དག །ལོ་གྲངས་འབུམ་གྱི་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma of this being of infinite fame Will remain for one hundred thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་གྲངས་ནི་ཐེར་འབུམ་དགུ་བཅུ་ཡོད། །
en: The relics of this victor will be abundant, And there will be ninety billion stūpas.

source: འཇིག་རྟེན་མགོན་པོ་མེ་ཏོག་རྒྱས་པ་ཡི། །སྐྱེ་ཡུལ་མེ་ཏོག་རྒྱས་པས་བརྒྱན་ཞེས་བྱ། །
en: “The protector of the world Puṣpita Will be born in a place called Adorned with Blooming Flowers.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་ཡོད་ཡབ་ནི་ངོས་བཟངས་ཡིན། །མེ་ཏོག་ཤིང་རྟ་རྒྱལ་ཡུམ་མེ་ཏོག་ནི། །སྲས་ཡིན་མེ་ཏོག་བཟང་པོ་རིམ་གྲོ་པ། །
en: The family of this victor will be brahmin, And his light will extend ten leagues. “Fine Face will be his father, and Flower Chariot will be this victor’s mother. Flower will be his son and Excellent Flower his attendant.

source: ཡོན་ཏན་མེ་ཏོག་འཆང་བ་བློ་ཅན་ཏེ། །
en: Holder of the Flower of Qualities will be the one intelligence

source: མེ་ཏོག་བསགས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Gathering of Flowers the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་དྲུག་ཀུན་ལའང་། །རྣམ་ཐར་མཆོག་དང་རྣམ་པར་གྲགས་ཐོབ་པ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་ལྔ་ལྔ་ཡོད། །
en: “There will be thirty-six consecutive congregations, Each of them gathering seven hundred fifty million Who have attained supreme liberation and fame.

source: མི་ཚེ་ལོ་གྲངས་སུམ་ཁྲི་དྲུག་སྟོང་ཡིན། །
en: The lifespan of humans will be thirty-six thousand years,

source: མྱ་ངན་འདས་ནས་དེ་ཡི་དམ་ཆོས་དག །ལོ་གྲངས་ཉི་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And after this teacher has attained nirvāṇa His sacred Dharma will remain for twenty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་འཕང་དུ། །དཔག་ཚད་གཅིག་པ་ལེགས་སྤྲས་མཐའ་ཡང་ཡས། །
en: The relics of this victor will be contained in a stūpa One league large and adorned with limitless decorations.

source: དེ་བཞིན་གཤེགས་པ་མཐུ་རྩལ་སྟབས་སྐྱེ་བའི། །ཡུལ་ནི་བསོད་ནམས་ཤིན་ཏུ་རྩལ་དང་ལྡན། །
en: “The thus-gone Vikrāntagamin Will be born in a place called Endowed with Extremely Powerful Merit.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གཉིས་ཡབ་ནི་མཐུ་རྩལ་ཅན། །འགྲོས་སྙོམས་པ་ནི་རྒྱལ་ཡུམ་མཐུ་རྩལ་ཅན། །སྲས་ཡིན་ཉམས་རྩལ་ཆེན་པོ་རིམ་གྲོ་པ། །
en: His family will be brahmin, And his light will extend twenty-two leagues. “Powerful will be his father, and Even Mode will be this victor’s mother. Powerful will be his son and Powerful Experience his attendant.

source: དགའ་བའི་མཐུ་རྩལ་ཅན་ནི་མཁས་པ་སྟེ། །
en: Endowed with Powerful Joy will be the one of intelligence

source: རྣམ་པར་གནོན་པའི་རྒྱལ་པོ་རྫུ་འཕྲུལ་ཅན། །
en: And Royal Subjugator the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཅྭ་བརྒྱད་ཀུན་ལ་ཡང་། །འཇིག་རྟེན་བདེ་དང་ཕན་ཕྱིར་གནས་པ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་རེ་རེ་ཡོད། །
en: “There will be eighteen consecutive congregations, Each of them gathering nine hundred million Who remain for the happiness and benefit of the world.

source: འདྲེན་པ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་སུམ་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And after this guide has attained nirvāṇa His sacred Dharma will remain for thirty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །འཇིག་རྟེན་དག་གིས་མཆོད་ཅིང་བཀུར་བར་འགྱུར། །
en: The relics of this victor will be abundant, Worshiped and venerated in the world.

source: དེ་བཞིན་གཤེགས་པ་བསོད་ནམས་ཕུང་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་འོད་ཅེས་བྱ། །
en: “The thus-gone Puṇyarāśi Will be born in a place called Light of Merit.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་བསོད་ནམས་བཟང་པོ་ཡབ། །བསོད་ནམས་འོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend one hundred leagues. “Excellent Merit will be his father, and Light of Merit will be this victor’s mother.

source: སྲས་པོ་ལེགས་དགའ་མཐུ་ལྡན་རིམ་གྲོ་པ། །
en: Excellent Joy will be his son and Powerful his attendant.

source: ནོར་ལ་དགའ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Enjoyer of Wealth will be the scholar

source: སེམས་ཅན་མཆོག་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Supreme Sentient Being the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །ཡེ་ཤེས་དགའ་བ་བྱང་ཆུབ་གཞོལ་བ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering nine hundred twenty million Who delight in wisdom and merge with awakening.

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་བདུན་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And after this teacher has attained parinirvāṇa His sacred Dharma will remain for seventy thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བཞི་པ་རྒྱལ་མཚན་དག་གིས་བསྐོར། །
en: The relics of this victor will reside in a stūpa Four leagues large and surrounded by banners.

source: དེ་བཞིན་གཤེགས་པ་གཟུགས་མཆོག་སྐྱེ་བ་ཡི། །ཡུལ་ནི་ལེགས་པར་བསམ་པ་སེམས་ཞེས་བྱ། །
en: “The thus-gone Śreṣṭharūpa Will be born in a place called Mind of Excellent Thought.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གཉིས་ཡབ་ནི་གཟུགས་བཟང་ཡིན། །གཟུགས་ལྡན་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, And his light will extend twenty-two leagues. “Excellent Form will be his father, and Possessor of Form will be this victor’s mother.

source: སྲས་པོ་སྡུ་གུ་མཛེས་པ་རིམ་གྲོ་པ། །
en: Delightful will be his son and Beauty his attendant.

source: ཡོན་ཏན་གཟུགས་ལྡན་པ་ནི་མཁས་པ་སྟེ། །
en: Possessing the Form of Excellent Qualities will be the scholar

source: གཟུགས་ལ་རྣམ་པར་ལྟ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Considering Forms the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་དྲུག་ཀུན་ལའང་། །ལས་དང་ཉོན་མོངས་སྲིད་དང་བྲལ་བ་པོ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གཉིས་གཉིས་ཡོད། །
en: “There will be sixty-six consecutive congregations, Each of them gathering two hundred twenty million Who are free from the becoming of karma and defilement.

source: མི་ཚེ་ལོ་གྲངས་དག་ནི་བདུན་ཁྲི་ཡིན། །
en: The lifespan of humans will be seventy thousand years,

source: འཇིག་རྟེན་མཁྱེན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་སུམ་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma of this knower of the world Will remain for thirty thousand years.

source: འཇིག་རྟེན་མཁྱེན་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །འཇིག་རྟེན་གསུམ་ཀུན་སྐུ་གདུང་རྒྱས་པར་འགྱུར། །
en: After this knower of the world has attained nirvāṇa His relics will fill the three worlds.

source: མི་ཡི་འདྲེན་པ་སྐར་མཁན་སྐྱེ་བ་ཡི། །ཡུལ་ནི་གཟི་བརྗིད་འོད་དང་ལྡན་ཞེས་བྱ། །
en: “The guide of humans Jyotiṣka Will be born in a place called Endowed with Splendid Light.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །སུམ་ཅུ་རྩ་གཉིས་ཡབ་ནི་ལེགས་སྣང་ཡིན། །གསལ་མཆོག་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend thirty-two leagues. “Excellent Light will be his father, and Supreme Luminosity will be this victor’s mother.

source: གླང་པོ་སྲས་ཡིན་གྲགས་པ་རིམ་གྲོ་པ། །
en: Elephant will be his son and Fame his attendant.

source: ཆོ་ག་བཟང་ཞེས་སྣང་ནི་བློ་ཅན་ཏེ། །
en: Light of Excellent Ritual will be the one of intelligence

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་ཀུན་ལ་ཡང་། །ཉོན་མོངས་རྒྱགས་པ་ཐམས་ཅད་ཞི་གྱུར་པ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་གསུམ་གསུམ་ཡོད། །
en: “There will be seventy consecutive congregations, Each of them gathering seven hundred thirty million Who have pacified all defilement and conceit.

source: ཞི་བར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་ཉི་ཁྲི་ཉིས་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma of the one gone in peace Will remain for twenty-two thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །ཀུན་ཀྱང་པད་མ་བླ་རེས་མཛེས་པར་བྱས། །
en: The relics of this victor will be abundant And decorated with lotus canopies.

source: དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་སྒྲོན་མ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ཉི་མའི་སྒྲོན་ཞེས་བྱ། །
en: “The thus-gone Candrapradīpa Will be born in a place called Sun Lamp.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་དཔག་ཚད། །དྲུག་ཅུ་རྩ་གསུམ་ཡབ་ནི་ཏོག་བཟངས་ཡིན། །འོད་རྒྱལ་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend sixty-three leagues. “Excellent Crest will be his father, and Victorious Light will be this victor’s mother.

source: སྲས་པོ་གཟི་བཟང་དགའ་བ་རིམ་གྲོ་པ། །
en: Excellent Splendor will be his son and Joy his attendant.

source: ལྷ་ཆེན་རྒྱལ་པོ་བློ་གྲོས་ཅན་ཡིན་ཏེ། །
en: King of Great Gods will be the one of intelligence

source: འཇིགས་པ་མེད་པའི་གཟི་བརྗིད་རྫུ་འཕྲུལ་ཅན། །
en: And Fearless Splendor the one of miracles.

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་ཀུན་ལ་ཡང་། །བསམ་གཏན་རྣམ་པར་ཐར་ལ་འཇིགས་མེད་པ། །བྱེ་བ་ཕྲག་ནི་དྲུག་ཅུ་དགུ་དགུ་ཡོད། །
en: “There will be seventy consecutive congregations, Each of them gathering six hundred ninety million Fearless practitioners of the concentrations and liberations.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་དྲུག་པ་རིན་པོ་ཆེ་ཡིས་སྤྲས། །
en: There will be a single stūpa with the relics of this victor, Six leagues large and studded with jewels.

source: དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་ཕུང་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་སྡུག་ཅེས་བྱ། །
en: “The thus-gone Tejorāśi Will be born in a place called Splendid Delight.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །སུམ་ཅུ་རྩ་དྲུག་ཏིལ་མར་དབང་པོ་ཡབ། །ལྷ་ཆེན་བློ་གྲོས་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །ཡེ་ཤེས་དགའ་ཡིན་སྣང་བ་རིམ་གྲོ་པ། །
en: His family will be brahmin, And his light will extend thirty-six leagues. “Sesame Oil Ruler will be his father, and Great Divine Intelligence will be this victor’s mother. Joy of Wisdom will be his son and Light his attendant.

source: སྣང་བ་མཐའ་ཡས་བློ་གྲོས་ཅན་ཡིན་ཏེ
en: Infinite Light will be the one of intelligence

source: བདག་ཉིད་ཆེན་པོའི་སྒྲོན་མ་རྫུ་འཕྲུལ་ཅན། །
en: And Lamp of Great Beings the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །འཇིག་རྟེན་ཆོས་ཀྱིས་ཉེ་བར་མ་གོས་པ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གཉིས་གཉིས་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering two hundred twenty million Who are free from the stains of the world.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །འགྲོ་བ་ཀུན་གྱིས་མཆོད་ཅིང་བཀུར་བར་འགྱུར། །
en: The relics of this victor will be abundant, Worshiped and venerated by all wandering beings.

source: བདེ་བར་གཤེགས་པ་བྱང་ཆུབ་རྒྱལ་པོ་ཡི། །སྐྱེ་ཡུལ་ཡེ་ཤེས་རྟོགས་པར་བྱེད་ཅེས་བྱ། །
en: “The well-gone Bodhirāja Will be born in a place called Wisdom That Causes Realization.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་དྲུག་ཅུ་ཡབ་ནི་བློ་བཟངས་ཡིན། །རྟོགས་བྱེད་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend sixty leagues. “Excellent Mind will be his father, and Causing Realization will be this victor’s mother.

source: སྲས་པོ་རྟོགས་ལྡན་རྟོགས་ཆེན་རིམ་གྲོ་པ། །
en: Endowed with Realization will be his son and Great Realization his attendant.

source: རྟོགས་སྦྱིན་ཞེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: Giver of Realization will be the one of intelligence

source: རྟོགས་པ་རྣམ་པར་ལྟ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Beholding Realization the one of miracles.

source: འདུས་པ་ལན་གྲངས་ཉི་ཤུ་ཀུན་ལ་ཡང་། །ཐར་དང་ལམ་མ་འཁྲུལ་ལ་དགའ་བ་པོ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གཉིས་གཉིས་ཡོད། །
en: “There will be twenty consecutive congregations, Each of them gathering two hundred twenty million Joyous ones free from delusion regarding liberation and the path.

source: མི་ཚེ་ལོ་གྲངས་ཉི་ཁྲི་བཞི་སྟོང་ཡིན། །
en: The lifespan of humans will be twenty-four thousand years,

source: འགྲོ་ལ་ཕན་ཕྱིར་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བརྒྱད་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And for the benefit of beings the sacred Dharma Will remain for eighty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་དགུ་པ་རིན་ཆེན་རྒྱལ་མཚན་བརྒྱན། །
en: The relics of this victor will reside in a single stūpa Nine leagues large and adorned with jewels.

source: སེམས་ཅན་སྙིང་པོ་མི་ཟད་སྐྱེ་བའི་ཡུལ། །འོད་ཟེར་དག་ནི་མི་ཟད་པ་ཞེས་བྱ། །
en: “The heart of beings Akṣaya Will be born in a place called Inexhaustible Radiance.

source: འོད་དཔག་ཚད། །བདུན་ཅུ་རྩ་གཅིག་མི་ཟད་སྲས་པོ་ཡབ། །རྒྱ་མཚོའི་སྒྲ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: And his light will extend seventy-one leagues. “Inexhaustible Prince will be his father, and Ocean Sound will be this victor’s mother.

source: སྲས་པོ་གྲགས་ལྡན་ལེགས་དག་རིམ་གྲོ་པ། །
en: Endowed with Fame will be his son and Excellent Purity his attendant.

source: བློ་གྲོས་མི་ཟད་པ་ནི་མཁས་པ་སྟེ། །
en: Inexhaustible Intelligence will be the scholar

source: བློ་རབ་མཆོག་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Supreme Mind the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཅུ་གཅིག་ཀུན་ལ་ཡང་། །འཇིག་རྟེན་དྲི་མ་དྲི་མེད་ཡིད་ལྡན་པ། །ཐེར་འབུམ་ཕྲག་ནི་དགུ་དགུ་འབྱུང་བར་འགྱུར། །
en: “There will be eleven consecutive congregations, Each of them gathering nine billion Whose minds are free from the stains of the world.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་འབུམ་ཕྲག་སྙེད་ཀྱི་འཁོར་དང་ལྡན། །
en: The relics of this victor will be abundant, Contained in hundreds of thousands of circles of stūpas.

source: རྒྱལ་བ་མངོན་པར་རྟོགས་པའི་སྤྱན་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་ཡེ་ཤེས་གནས་ཞེས་བྱ། །
en: “The victor Subuddhinetra Will be born in a place called Abode of Wisdom.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གསུམ་ཡོད་ཡབ་ནི་མིག་བཟངས་ཡིན། །མིག་སྡུག་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend three leagues. “Excellent Eye will be his father, and Lovely Eye will be this victor’s mother.

source: སྲས་པོ་མིག་ལེགས་བྱམས་པ་རིམ་གྲོ་པ། །
en: Fine Eye will be his son and Love his attendant.

source: བདུད་རྩིའི་མིག་ཅེས་བྱ་བ་བློ་ཅན་ཏེ། །
en: Nectar Eye will be the one of intelligence

source: མིག་སྦྱངས་པ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Purified Eye the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་གཉིས་ཀུན་ལའང་། །དྲི་གསུམ་དྲི་མ་ཤིན་ཏུ་དྲི་མེད་པ། །དེ་དག་བྱེ་བརྒྱ་དྲུག་ཅུ་གསུམ་གསུམ་ཡོད། །
en: “There will be thirty-two consecutive congregations, Each of them gathering sixty-three billion Whose minds are completely free from the three stains.

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་དགུ་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And after this teacher has attained parinirvāṇa His sacred Dharma will remain for ninety thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །ལྷ་མི་དག་གིས་མཆོད་པ་བྱས་པར་འགྱུར། །
en: The relics of this victor will reside in a single stūpa, Receiving the worship of gods and humans.

source: དེ་བཞིན་གཤེགས་པ་ཡན་ལག་རྒྱས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་རྣམ་པར་དག་ཅེས་བྱ། །
en: “The thus-gone Pūritāṅga Will be born in a place called Pure.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་ཉི་ཤུ་ཡབ་ནི་ལེགས་མཆོག་ཡིན། །ཡན་ལག་མཆོག་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, And his light will extend twenty leagues. “Supreme Excellence will be his father, and Supreme Limbs will be this victor’s mother.

source: སྲས་པོ་བླ་མ་འཕགས་པ་རིམ་གྲོ་པ། །
en: Highest will be his son and Superior his attendant.

source: འཇིག་རྟེན་འདས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Beyond the World will be the scholar

source: འགྲོ་བ་ཀུན་གྱི་བླ་མ་རྫུ་འཕྲུལ་ཅན། །
en: And Guru of All Beings the one of miracles.

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་ཀུན་ལ་ཡང་། །དགྲ་བཅོམ་ཚོགས་ཀུན་དག་ནི་རྒྱས་འགྱུར་ཏེ། །ཁྲི་ཕྲག་དག་ནི་དྲུག་ཅུ་གསུམ་གསུམ་ཡོད། །
en: “There will be seventy consecutive congregations, Each of them gathering a full group Of six hundred thirty thousand worthy ones.

source: མི་ཚེ་ལོ་གྲངས་དགུ་ཁྲི་ཆིག་སྟོང་ཡིན། །
en: The lifespan of humans will be ninety thousand years,

source: འགྲོ་ལ་ཕན་ཕྱིར་དེ་ཡི་དམ་ཆོས་དག །ལོ་གྲངས་དགུ་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And for the benefit of beings The sacred Dharma will remain for ninety thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །འགྲོ་བ་ཀུན་གྱིས་བཀུར་ཞིང་མཆོད་པར་འགྱུར། །
en: The relics of this victor will be abundant, Venerated and worshiped by all wandering beings.

source: དེ་བཞིན་གཤེགས་པ་ཡུལ་འཁོར་ཤེས་རབ་ཀྱི། །སྐྱེ་བའི་ཡུལ་ནི་ཡུལ་འཁོར་འབྱུང་ཞེས་བྱ། །
en: “The thus-gone Prajñārāṣṭra Will be born in a place called Emerging Land.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡུལ་འཁོར་དབང་པོ་ཡབ། །ཡུལ་འཁོར་མཆོག་མ་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །ཡུལ་འཁོར་བཟང་པོ་ཡུལ་འཁོར་རིམ་གྲོ་པ། །
en: His family will be brahmin, And his light will extend one hundred leagues. “Lord of the Land will be his father, and Supreme Land will be this victor’s mother. Land of Excellence will be his son and Land his attendant.

source: ཡུལ་འཁོར་ཆེན་པོ་བློ་གྲོས་ཅན་ཡིན་ཏེ། །
en: Great Land will be the one of intelligence

source: བྱང་ཆུབ་ཕྲད་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Encounter with Awakening the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །སྲེད་དང་ཉོན་མོངས་པ་དང་བྲལ་བ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་དགུ་བཅུ་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering nine hundred million beings Who are freed from cravings and defilements.

source: སྲིད་མཐར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་དགུ་ཁྲི་དགུ་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma of the one who has gone to the end of existence Will remain for ninety-nine thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །འགྲོ་བ་ཀུན་གྱིས་སྤྱི་བོས་མནོས་པར་འགྱུར། །
en: The relics of this victor will be abundant, And all wandering beings will prostrate to them.

source: འཇིག་རྟེན་མགོན་པོ་མཆོག་མ་སྐྱེ་བ་ཡི། །ཡུལ་ནི་ཐམས་ཅད་མཆོག་ཏུ་ཕྱིན་ཅེས་བྱ། །
en: “The protector of the world, Uttama, Will be born in a place called Supreme in All Regards.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །སུམ་ཅུ་རྩ་གཉིས་བདག་ཉིད་ཆེན་པོ་ཡབ། །མཆོག་གི་བློ་གྲོས་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །མཆོག་གི་རྒྱལ་པོ་ཡོན་ཏན་རིམ་གྲོ་པ། །
en: His family will be brahmin, And his light will extend thirty-two leagues. “Great Being will be his father, and Supreme Intelligence will be this victor’s mother. Supreme King will be his son and Qualities his attendant.

source: ལྷས་མཆོད་པ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Worshiped by Gods the one of miracles.

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་དྲུག་ཀུན་ལའང་། །ཐམས་ཅད་རྣམ་གྲོལ་བྱང་ཆུབ་གཞོལ་བ་པོ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་གསུམ་གསུམ་ཡོད། །
en: “There will be seventy consecutive congregations, Each of them gathering seven hundred thirty million Who merge with liberation and awakening.

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་བརྒྱད་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And after this teacher has attained nirvāṇa His sacred Dharma will remain for eighty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་ནི། །བདུན་ཅུ་པ་སྟེ་གཅིག་ཡིན་བླ་རེས་བརྒྱན། །
en: The stūpa with the relics of this victor Will be seventy leagues large and adorned with canopies.

source: དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་ཚིམ་མཛད་ཀྱི། །སྐྱེ་བའི་ཡུལ་ནི་རིམས་ནད་མེད་ཅེས་བྱ། །
en: “The thus-gone Toṣitatejas Will be born in a place called Free from Contagion.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་ཡོད་ཡབ་ནི་གསལ་བ་ཡིན། །གསལ་ལྡན་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend nine leagues. “Luminous will be his father, and Endowed with Luminosity will be this victor’s mother.

source: སྲས་པོ་ཞུམ་མེད་དམན་མེད་རིམ་གྲོ་པ། །
en: Undaunted will be his son and Not Inferior his attendant.

source: ཡོན་ཏན་མཐུ་རྩལ་ཅན་ནི་མཁས་པ་སྟེ། །
en: Powerful Qualities will be the scholar

source: འཕགས་པ་བསྡུས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Gathering of the Superior the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་གཉིས་ཀུན་ལའང་། །དགྲ་བཅོམ་ཡིད་ནི་ཡོངས་སུ་དག་པ་པོ། །དེ་དག་བྱེ་བ་ཕྲག་ནི་སྟོང་སྟོང་ཡོད། །
en: “There will be sixty-two consecutive congregations, Each of them gathering ten billion Worthy ones of perfectly pure mind.

source: མི་ཚེ་ལོ་གྲངས་དག་ནི་དྲུག་ཁྲི་ཡིན། །
en: The lifespan of humans will be sixty thousand years,

source: རྒྱལ་བ་ཡོངས་སུ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་སྟོང་དུ་གནས་པར་འགྱུར། །
en: “And after this victor has attained parinirvāṇa His sacred Dharma will remain for one thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །ནོར་བུ་མེ་ཤེལ་བརྒྱ་ཡི་དྲ་བས་སྤྲས། །
en: The relics of this victor will be abundant And adorned with nets of hundreds of jewels and crystals.

source: སངས་རྒྱས་ཤེས་རབ་བྱིན་ནི་སྐྱེ་བ་ཡི། །ཡུལ་ནི་རྨད་དུ་བྱུང་བའི་འོད་ཅེས་བྱ། །
en: “The buddha Prajñādatta Will be born in a place called Wondrous Light.
